Revit 2017 API
IndependentTag.LeaderEndCondition Property
 The leader end condition of the tag.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public LeaderEndCondition LeaderEndCondition { get; set; }
Visual Basic
Public Property LeaderEndCondition As LeaderEndCondition
	Get
	Set
Visual C++
public:
property LeaderEndCondition LeaderEndCondition {
	LeaderEndCondition get ();
	void set (LeaderEndCondition value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: LeaderEndCondition cannot be assigned.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace